Hey Justin, 

Please see the attached full terraform plan. I also enabled tf_log debug with the run as well. For reference, I pulled a snippet of the 2 aws_vpc resource and data resources from the run.


 # module.network.aws_vpc.vpc[0] will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-0de6415e1a5f3affa"
      ~ tags                                 = {
          ~ "Owner"                                             = "jmolnar7@zscaler.com" -> "jmolnar8@zscaler.com"
            # (4 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "Owner"                                             = "jmolnar7@zscaler.com" -> "jmolnar8@zscaler.com"
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }


# module.network.data.aws_vpc.vpc_selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc" "vpc_selected" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = "vpc-0de6415e1a5f3affa"
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }
[terraform_debug.log](https://github.com/hashicorp/terraform-provider-aws/files/10492113/terraform_debug.log)
[terraform_apply.log](https://github.com/hashicorp/terraform-provider-aws/files/10492114/terraform_apply.log)

